Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: འཇིག་རྟེན་ཐམས་ཅད་ལ་ཡིད་བརྟན་དུ་མི་རུང་བའི་འདུ་ཤེས་དང་། སྡུག་བསྔལ་ཤེས་པ་དང་། ཀུན་འབྱུང་བ་ཤེས་པ་དང་། འགོག་པ་ཤེས་པ་དང་། ལམ་ཤེས་པ་དང་། ཟད་པ་ཤེས་པ་དང་། མི་སྐྱེ་བ་ཤེས་པ་དང་། ཆོས་ཤེས་པ་དང་། རྗེས་སུ་འགྲོ་བ་ཤེས་པ་དང་། ཀུན་རྫོབ་ཤེས་པ་དང་། འདྲིས་པ་ཤེས་པ་དང་། སྒྲ་ཇི་བཞིན་ཤེས་པ་བསྒོམ་པར་བྱའོ། །རྣམ་པར་རྟོག་པ་དང་བཅས། རྣམ་པར་དཔྱོད་པ་དང་བཅས་པའི་ཏིང་ངེ་འཛིན་དང་། རྣམ་པར་རྟོག་པ་མེད་ཅིང་རྣམ་པར་དཔྱོད་པ་ཙམ་གྱི་ཏིང་ངེ་འཛིན་དང་། རྣམ་པར་རྟོག་པ་མེད་ཅིང་རྣམ་པར་དཔྱོད་པ་མེད་པའི་ཏིང་ངེ་འཛིན་དང་། ཡོངས་སུ་མ་ཤེས་པ་ཡོངས་སུ་ཤེས་པར་བྱ་བའི་དབང་པོ་དང་། ཀུན་ཤེས་པའི་དབང་པོ་དང་། ཀུན་ཤེས་པ་རིག་པའི་དབང་པོ་དང་། ཟིལ་གྱིས་གནོན་པའི་སྐྱེ་མཆེད་དང་། ཆུབ་པའི་སྐྱེ་མཆེད་དང་། བསྡུ་བའི་དངོས་པོ་བཞི་དང་། རྣམ་པར་དགོད་པ་བཞི་དང་། ས་བཅུ་དང་། སྤྱོད་པ་བཅུ་དང་། བཟོད་པ་བཅུ་དང་། ལྷག་པའི་བསམ་པ་ཉི་ཤུ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་དང་། ཞི་གནས་དང་། ལྷག་མཐོང་ཤེས་པ་དང་། རིག་པ་གསུམ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། མི་འཇིགས་པ་བཞི་དང་། མ་ཉམས་པའི་མངོན་པར་ཤེས་པ་ལྔ་དང་། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་དང་། ནོར་བདུན་དང་།
en: They should cultivate the recollection of the Buddha, the recollection of the Dharma, the recollection of the Saṅgha, the recollection of ethical discipline, the recollection of giving away, the recollection of the god realms, the recollection of breathing, the recollection of disillusionment, the recollection of death, and the recollection of the body; the perception of impermanence, the perception of suffering, the perception of nonself, the perception of unattractiveness, the perception of death, the perception of disinterest with respect to all mundane phenomena, and the perception that all mundane phenomena are unreliable; and the knowledge of suffering, the knowledge of the origin of suffering, the knowledge of the cessation of suffering, the knowledge of the path, the knowledge of the extinction of contaminants, the knowledge that contaminants will not arise again, the knowledge of phenomena, the knowledge of phenomena that is subsequently realized, the knowledge of the relative, the knowledge that is masterful, and the knowledge that is semantic.

source: སྐྱེས་བུ་ཆེན་པོའི་རྣམ་པར་རྟོག་པ་བརྒྱད་དང་། སེམས་ཅན་གྱི་གནས་དགུ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་། བྱམས་པ་ཆེན་པོ་དང་།
en: They should perfect the meditative stability endowed with ideation and scrutiny, the meditative stability free from ideation and endowed merely with scrutiny, the meditative stability devoid of both ideation and scrutiny, the faculties that will enable knowledge of all that is unknown, the faculties that acquire the knowledge of all phenomena, the faculties endowed with the knowledge of all phenomena, the sense fields of mastery, the sense fields of complete suffusion, the four attractive qualities of a bodhisattva, the four determinations, the ten levels, the ten modes of conduct, the ten aspects of tolerance, the twenty higher aspirations, omniscient wisdom, stillness, the knowing of higher insight, the three knowledges, the four kinds of exact knowledge, the four fearlessnesses, {Dt.21} the five undiminished extrasensory powers, the six perfections, the seven aspects of spiritual wealth, the eight notions of saintly beings, the nine states of beings, the ten powers of the tathāgatas, the eighteen distinct qualities of the buddhas, great loving kindness, great compassion, great empathetic joy, and great equanimity. “

source: སྙིང་རྗེ་ཆེན་པོ་དང་། དགའ་བ་ཆེན་པོ་དང་། བཏང་སྙོམས་ཆེན་པོ་ཡོངས་སུ་རྫོགས་པར་བྱའོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་རྣམ་པའི་མཆོག་ཐམས་ཅད་དང་ལྡན་པ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པ་དང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་དང་།
en: Bodhisattva great beings who wish to attain consummate buddhahood, all-aspect omniscience in all its finest aspects, and who wish to attain the knowledge of the path, the knowledge of all the dharmas, and knowledge of the aspects of all beings’ minds, their conduct, and their knowledge, should persevere in the perfection of wisdom.

source: ཐམས་ཅད་ཤེས་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་། སྤྱོད་པ་དང་། ཤེས་པའི་རྣམ་པའི་ཤེས་པ་ཉིད་ཡོངས་སུ་རྫོགས་པར་བྱ་བར་འདོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བརྩོན་པར་བྱའོ། །བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་སྤང་བར་འདོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བརྩོན་པར་བྱ་སྟེ།
en: Bodhisattva great beings who wish to abandon all the afflicted mental states and their connecting propensities should persevere in the perfection of wisdom. “

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: So it is, Śāradvatīputra, that bodhisattva great beings should persevere in the perfection of wisdom. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་འཇུག་པར་འདོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱིས་ཤེས་པར་འདོད་པ་དང་། ས་དེ་དག་ལས་འདའ་བར་འདོད་པ་དང་།
en: Śāradvatīputra, bodhisattva great beings who wish to enter a bodhisattva’s full maturity should persevere in the perfection of wisdom.

source: ཕྱིར་མི་ལྡོག་པའི་ས་ལ་གནས་པར་འདོད་པ་དང་། མངོན་པར་ཤེས་པ་དྲུག་ལ་གནས་པར་འདོད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་སྤྱོད་པ་རྣམ་པར་གཡོ་བ་ཤེས་པར་འདོད་པ་དང་། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཤེས་པ་ཟིལ་གྱིས་གནོན་པར་འདོད་པ་དང་། གཟུངས་ཀྱི་སྒོ་དང་ཏིང་ངེ་འཛིན་གྱི་སྒོ་མང་པོ་ཐོབ་པར་འདོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: Bodhisattva great beings who wish to know the levels of the śrāvakas and the levels of the pratyekabuddhas, who wish to transcend those levels, who wish to remain at the level at which progress is irreversible, who wish to dwell in the six extrasensory powers, who wish to understand all beings’ wavering minds and conduct, who wish to surpass the understanding of all śrāvakas and pratyekabuddhas, and who wish to attain the many dhāraṇī gateways and the gateways of meditative stability should all train in the perfection of wisdom. “

source: །ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པའི་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་སྦྱིན་པ་གཏོང་བ་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་ཐམས་ཅད་རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་སེམས་བསྐྱེད་པ་གཅིག་གིས་ཟིལ་གྱིས་གནན་པར་འདོད་པ་དང་། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཚུལ་ཁྲིམས་དང་། ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་དང་། རྣམ་པར་གྲོལ་བ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་སེམས་བསྐྱེད་པ་གཅིག་གིས་ཟིལ་གྱིས་གནན་པར་འདོད་པ་དང་། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་།
en: Bodhisattva great beings who wish to surpass, with a single setting of the mind on enlightenment while rejoicing in them, all the virtuous roots of generosity practiced by sons and daughters of the family of those following the śrāvakas’ and pratyekabuddhas’ vehicles; {Dt.22} who wish to surpass, with a single setting of the mind on enlightenment while rejoicing in them, the ethical discipline, meditative stability, wisdom, liberation, and seeing the wisdom of liberation of all śrāvakas and pratyekabuddhas; and who wish to surpass, with a single setting of the mind on enlightenment while rejoicing in them, all the meditative concentrations, liberation, meditative stabilities, and meditative absorptions of all śrāvakas and pratyekabuddhas should train in the perfection of wisdom. “

source: སྙོམས་པར་འཇུག་པ་ཐམས་ཅད་རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་སེམས་བསྐྱེད་པ་གཅིག་གིས་ཟིལ་གྱིས་གནན་པར་འདོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །གཞན་ཡང་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་སྦྱིན་པ་ཆུང་ངུ་བྱིན་ཡང་། ཐབས་མཁས་པས་ཡོངས་སུ་བསྔོ་བའི་ཚུལ་གྱིས། ཇི་ལྟ་བུར་ན་ཚད་མེད་གྲངས་མེད་དཔག་ཏུ་མེད་པར་འགྱུར་སྙམ་ནའང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: Moreover, Śāradvatīputra, if bodhisattva great beings, for the benefit of all beings, offer even a small gift and wonder how it is that through dedication by skillful means these gifts can become immeasurable, countless, and inestimable those bodhisattva great beings should train in the perfection of wisdom.

source: །དེ་བཞིན་དུ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་ཚུལ་ཁྲིམས་ཆུང་ངུ་བསྲུངས། བཟོད་པ་ཆུང་ངུ་བསྒོམས་བརྩོན་འགྲུས་ཆུང་ངུ་བརྩམས། བསམ་གཏན་ཆུང་ངུ་ལ་མཉམ་པར་བཞག །ཤེས་རབ་ཆུང་ངུ་བསྒོམས་ཀྱང་། ཐབས་མཁས་པས་ཡོངས་སུ་བསྔོ་བའི་ཚུལ་གྱིས། ཇི་ལྟ་བུར་ན་ཚད་མེད་གྲངས་མེད་དཔག་ཏུ་མེད་པར་འགྱུར་སྙམ་ན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: Similarly, if for the benefit of all beings they maintain even a little ethical discipline; cultivate even a little tolerance; apply even a little perseverance; are absorbed in even a little meditative concentration; and cultivate even a little wisdom, and wonder how it is that through dedication by skillful means these can become immeasurable, countless, and inestimable, those bodhisattva great beings should also train in the perfection of wisdom. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་པར་འདོད་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བར་འདོད་པ་དང་། དེ་བཞིན་དུ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པར་འདོད་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བར་འདོད་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པར་འདོད་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བར་འདོད་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པར་འདོད་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བར་འདོད་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པར་འདོད་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བར་འདོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པར་འདོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བར་འདོད་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: Moreover, Śāradvatīputra, bodhisattva great beings who wish to dwell in the perfection of generosity and wish to perfect the perfection of generosity, and similarly who wish to practice the perfection of ethical discipline and wish to perfect the perfection of ethical discipline, who wish to practice the perfection of tolerance and wish to perfect the perfection of tolerance, who wish to practice the perfection of perseverance and wish to perfect the perfection of perseverance, who wish to practice the perfection of meditative concentration and wish to perfect the perfection of meditative concentration, and who wish to practice the perfection of wisdom and wish to perfect the perfection of wisdom, should all train in the perfection of wisdom. {

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཇི་ལྟར་ན་ཚེ་རབས་ཐམས་ཅད་དུ་བདག་གིས་སངས་རྒྱས་ཀྱི་སྐུ་མཐོང་བར་འགྱུར། ཇི་ལྟར་ན་སངས་རྒྱས་ཀྱིས་བསྐུལ་བར་འགྱུར། ཇི་ལྟར་ན་སངས་རྒྱས་ཀྱིས་དགོངས་པར་འགྱུར། ཇི་ལྟར་ན་སངས་རྒྱས་མཉེས་པར་འགྱུར། ཇི་ལྟར་ན་སངས་རྒྱས་ཀྱིས་ཡོངས་སུ་གཟུང་བར་འགྱུར་སྙམ་ན་ཡང་།
en: Dt.23} “Moreover, Śāradvatīputra, bodhisattva great beings who wonder how it is that they themselves will behold the body of the buddhas in all their lives, how it is that they will be encouraged by the buddhas, how it is that they will be kept in mind by the buddhas, how it is that they will please the buddhas, and how it is that they will be accepted by the buddhas, should also train in the perfection of wisdom. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སངས་རྒྱས་ཀྱི་སྐུ་ཡོངས་སུ་བསྒྲུབ་པར་འདོད་པ་དང་། མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཐོབ་པར་འདོད་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་ཐོབ་པར་འདོད་པ་དང་། ཚེ་རབས་ཐམས་ཅད་དུ་ཚེ་རབས་དྲན་པ་དང་། བྱང་ཆུབ་ཀྱི་སེམས་མི་སྟོར་བ་དང་།
en: Moreover, Śāradvatīputra, bodhisattva great beings who wish to accomplish the body of the buddhas and who wish to attain the thirty-two major marks of a great person should train in the perfection of wisdom. “

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མི་ཉམས་པ་ཐོབ་པར་འདོད་པ་དང་། སྡིག་ཏོའི་མཛའ་བོ་དང་། སྡིག་ཏོའི་གྲོགས་པོ་ཐམས་ཅད་སྤང་བར་འདོད་པ་དང་། དགེ་བའི་བཤེས་གཉེན་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་བསྙེན་བཀུར་བར་འདོད་པ་དང་། བདུད་དང་བདུད་ཀྱི་རིས་སུ་གཏོགས་པའི་ལྷ་ཐམས་ཅད་ཕམ་པར་བྱ་བར་འདོད་པ་དང་། སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སྦྱང་བར་འདོད་པ་དང་། ཆོས་ཐམས་ཅད་ལ་བསྒྲིབས་པ་མེད་པ་ཐོབ་པར་འདོད་པས།
en: Bodhisattva great beings who wish to attain the eighty minor marks, who wish throughout all their lives to recall their succession of former lives, who wish never to give up the mind of enlightenment, who wish to attain bodhisattva conduct that is unspoiled, who wish to forsake all evil friends and all evil associates, who wish to serve and respect all buddhas and bodhisattvas who are virtuous spiritual mentors, who wish to defeat Māra and all the gods belonging to the class of Māra, who wish to purify all obscurations, and who wish to be unobscured with respect to all phenomena should train in the perfection of wisdom. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའི་རིགས་ཡོངས་སུ་བསྒྲུབ་པར་འདོད་པ་དང་། སངས་རྒྱས་ཀྱི་རིགས་བསྒྲུབ་པར་འདོད་པ་དང་། དཀོན་མཆོག་གསུམ་གྱི་གདུང་རྒྱུན་མི་གཅད་པའི་དོན་དུ་གནས་པར་འདོད་པས།
en: Moreover, Śāradvatīputra, bodhisattva great beings who wish to perfect the family of the bodhisattvas, who wish to accomplish the family of the buddhas, and who wish to maintain the lineage of the Three Precious Jewels without interruption should train in the perfection of wisdom. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཞོན་ནུའི་ས་ཐོབ་པར་འདོད་པ་དང་། སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དང་མི་འབྲལ་བར་འདོད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་ལས་འདའ་བར་འདོད་པ་དང་། མྱུར་དུ་དེ་བཞིན་གཤེགས་པའི་ས་ཡོངས་སུ་རྫོགས་པར་བྱ་བར་འདོད་པས།
en: Moreover, Śāradvatīputra, bodhisattva great beings who wish to attain the level of a crown prince, who wish never to be separated from all the buddhas and bodhisattvas, who wish to go beyond the levels of the bodhisattvas, and who wish to swiftly perfect the level of the tathāgatas should train in the perfection of wisdom. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དགེ་བའི་རྩ་བ་རྣམ་པ་གང་དང་གང་གིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་རིམ་གྲོར་བྱ་བ་དང་། བཀུར་སྟིར་བྱ་བ་དང་། བསྟི་སྟང་དུ་བྱ་བ་དང་། མཆོད་པ་བྱེད་པ་དེ་ལྟ་བུའི་དགེ་བའི་རྩ་བ་དེ་དག་དང་། རྣམ་པ་དེ་དག་ཕུན་སུམ་ཚོགས་པར་འགྱུར་བར་དགའ་བས།
en: Moreover, Śāradvatīputra, bodhisattva great beings who take delight in perfecting in this way whichever roots of virtuous action with which they might serve, venerate, honor, and worship the blessed lord buddhas should train in the perfection of wisdom. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་དགའ་བར་བྱ་བར་འདོད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བར་འདོད་པ་དང་། ཟས་དང་སྐོམ་དང་གོས་དང་རྒྱན་དང་མེ་ཏོག་དང་བདུག་སྤོས་དང་ཕྲེང་བ་དང་བྱུག་པ་དང་ཕྱེ་མ་དང་མལ་ཆ་དང་སྟན་དང་གནས་དང་ནད་ཀྱི་རྐྱེན་རྩི་དང་ཡོ་བྱད་དང་ནོར་དང་འབྲུ་དང་ལྷབ་ལྷུབ་དང་ནོར་བུ་དང་མུ་ཏིག་དང་བཻཌཱུརྱ་དང་དུང་དང་མན་ཤེལ་དང་། བྱི་རུ་དང་ས་ལེ་སྦྲམ་དང་དངུལ་དང་བཟའ་ཤིང་གི་ར་བ་དང་། རྒྱལ་པོའི་སྲིད་ལ་སོགས་པ་ཡོ་བྱད་དང་། ལོངས་སྤྱོད་ཐམས་ཅད་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་ཚིམ་པར་བྱའོ་སྙམ་ན་ཡང་།
en: Moreover, Śāradvatīputra, when bodhisattva great beings wish to delight all beings, wish to fulfill the aspirations of all beings, and think that they should satisfy all beings with all necessities and resources such as food, drink, clothing, ornaments, flowers, incense, garlands, unguents, powders, bedding, seats, dwellings, medicines, goods, riches, grains, embellishments, jewels, pearls, beryl, conch, quartz, coral, pure gold, silver, orchards, and kingdoms, they too should train in the perfection of wisdom. {

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕྱོགས་ཐམས་ཅད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། སེམས་ཅན་གང་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་དགོད་པར་འདོད་པ་དང་། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་དང་། གསུམ་ལ་སྐྱབས་སུ་འགྲོ་བ་དང་། སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་ལ་མོས་པ་ཐོབ་པ་ལ་དགོད་པར་འདོད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་གསུམ་པ།
en: Dt.24} “Moreover, Śāradvatīputra, bodhisattva great beings who wish to establish all beings, as many as there are in the world systems of all directions, numerous as the grains of sand of the river Gaṅgā, in the paths of the ten virtuous actions, and who wish to establish them in the four meditative concentrations, the four immeasurable attitudes, the five extrasensory powers, taking refuge in the Three Jewels, and devotion to the Buddha, the Dharma, and the Saṅgha should train in the perfection of wisdom. “

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཇིག་རྟེན་གྱི་ཁམས་ཆོས་ཀྱི་དབྱིངས་ཀྱིས་ཀླས་པ། ནམ་མཁའི་དབྱིངས་ཀྱི་མཐས་གཏུགས་པའི་སེམས་ཅན་ཐམས་ཅད་ཐེག་པ་ཆེན་པོ་ལ་གཟུད་པར་འདོད་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་དགོད་པར་འདོད་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: Moreover, Śāradvatīputra, bodhisattva great beings who wish to bring into the Great Vehicle the beings in all worlds within the whole infinity of the realm of phenomena and the very reaches of the realm of space, and who wish to establish them in the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom, should train in the perfection of wisdom. “

source: བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་དགོད་པར་འདོད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དགེ་བའི་སེམས་བསྐྱེད་པ་གཅིག་འགའ་ཡང་སྙིང་པོ་བྱང་ཆུབ་ལ་ནམ་འདུག་གི་བར་དུ་མི་ཟད་པར་བྱ་བར་འདོད་པས།
en: Moreover, Śāradvatīputra, bodhisattva great beings who wish to render even a single virtuous setting of the mind on enlightenment inexhaustible until the moment they are on the seat of enlightenment should train in the perfection of wisdom. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་ཇི་སྙེད་བཞུགས་པ་དེ་དག་ཐམས་ཅད་བདག་གི་ཡོན་ཏན་བརྗོད་པར་དགའ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: Moreover, Śāradvatīputra, bodhisattva great beings who are eager for all the blessed lord buddhas, as many as there are in the world systems of the eastern direction, numerous as the grains of sand of the river Gaṅgā, to praise their qualities should train in the perfection of wisdom.

source: །དེ་བཞིན་དུ་ལྷོ་དང་ནུབ་དང་བྱང་དང་བྱང་ཤར་དང་ཤར་ལྷོ་དང་ལྷོ་ནུབ་དང་ནུབ་བྱང་དང་འོག་དང་སྟེང་གི་ཕྱོགས་ཀྱི་ཕྱོགས་རེ་རེ་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་ཇི་སྙེད་བཞུགས་པ་དེ་དག་ཐམས་ཅད་བདག་གི་ཡོན་ཏན་བརྗོད་པར་དགའ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: Bodhisattva great beings who are eager for all the blessed lord buddhas, as many as there are likewise in each of the world systems of the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, and at the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā, to praise their qualities should train in the perfection of wisdom. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་ཤར་ཕྱོགས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་པོ་དེ་དག་ཐམས་ཅད་དུ་སེམས་བསྐྱེད་པ་གཅིག་གིས་འགྲོ་བར་འདོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: Moreover, Śāradvatīputra, bodhisattva great beings who, with a single thought, wish to journey to all those buddhafields of the eastern direction, numerous as the grains of sand of the river Gaṅgā, should train in the perfection of wisdom.

source: །དེ་བཞིན་དུ་ལྷོ་དང་ནུབ་དང་བྱང་དང་བྱང་ཤར་དང་ཤར་ལྷོ་དང་ལྷོ་ནུབ་དང་ནུབ་བྱང་དང་། འོག་དང་སྟེང་གི་ཕྱོགས་ཀྱི་ཕྱོགས་རེ་རེ་ཞིང་སངས་རྒྱས་ཀྱི་ཞིང་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་པོ་དེ་དག་ཐམས་ཅད་དུ་སེམས་བསྐྱེད་པ་གཅིག་གིས་འགྲོ་བར་འདོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: Bodhisattva great beings who, with a single thought, wish to journey likewise to all those buddhafields of the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, and at the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā, should train in the perfection of wisdom. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་ཤར་ཕྱོགས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་པོ་དེ་དག་ཐམས་ཅད་དུ་སྒྲ་གཅིག་གི་དབྱངས་ཀྱིས་གོ་བར་བྱ་བར་འདོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: Moreover, Śāradvatīputra, bodhisattva great beings who wish, by voicing a single sound, to make themselves heard in all those buddhafields of the eastern direction, numerous as the grains of sand of the river Gaṅgā, should train in the perfection of wisdom.

source: །དེ་བཞིན་དུ་ལྷོ་དང་ནུབ་དང་བྱང་དང་བྱང་ཤར་དང་ཤར་ལྷོ་དང་ལྷོ་ནུབ་དང་ནུབ་བྱང་དང་། འོག་དང་སྟེང་གི་ཕྱོགས་ཀྱི་ཕྱོགས་རེ་རེ་ཞིང་སངས་རྒྱས་ཀྱི་ཞིང་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་པོ་དེ་དག་ཐམས་ཅད་དུ་སྒྲ་གཅིག་གི་དབྱངས་ཀྱིས་གོ་བར་བྱ་བར་འདོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: Bodhisattva great beings who wish, by voicing a single sound, to make themselves heard likewise in all those buddhafields of the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, and at the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā, should train in the perfection of wisdom. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སངས་རྒྱས་ཀྱི་སྐྱེ་བ་རྒྱུན་མི་གཅད་པའི་དོན་དུ་གནས་པར་འདོད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རིགས་ཡོངས་སུ་བསྒྲུབ་པར་འདོད་པ་དང་། སངས་རྒྱས་ཀྱི་རིགས་རྒྱུན་མི་གཅད་པའི་དོན་དུ་གནས་པར་འདོད་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: Moreover, Śāradvatīputra, bodhisattva great beings who wish to remain for the sake of buddhas continuing to be born without interruption, who wish the family of bodhisattvas to reach accomplishment, and who wish to remain so that the family of the buddhas might continue without interruption should train in the perfection of wisdom. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་ནང་སྟོང་པ་ཉིད་ལ་གནས་པར་འདོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །དེ་བཞིན་དུ་ཕྱི་སྟོང་པ་ཉིད་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་དང་། སྟོང་པ་ཉིད་སྟོང་པ་ཉིད་དང་། ཆེན་པོ་སྟོང་པ་ཉིད་དང་། དོན་དམ་པ་སྟོང་པ་ཉིད་དང་། འདུས་བྱས་སྟོང་པ་ཉིད་དང་། འདུས་མ་བྱས་སྟོང་པ་ཉིད་དང་། མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་དང་། ཐོག་མ་དང་ཐ་མ་མེད་པ་སྟོང་པ་ཉིད་དང་། དོར་བ་མེད་པ་སྟོང་བ་ཉིད་དང་། རང་བཞིན་སྟོང་པ་ཉིད་དང་། ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་དང་།
en: Moreover, Śāradvatīputra, bodhisattva great beings who wish to dwell in the emptiness of internal phenomena should train in the perfection of wisdom.

source: རང་གི་མཚན་ཉིད་སྟོང་པ་ཉིད་དང་། མི་དམིགས་པ་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པ་སྟོང་པ་ཉིད་དང་། ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ལ་གནས་པར་འདོད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: Similarly, those who wish to dwell in the emptiness of external phenomena, the emptiness of both external and internal phenomena, the emptiness of emptiness, the emptiness of great extent, the emptiness of ultimate reality, the emptiness of conditioned phenomena, the emptiness of unconditioned phenomena, the emptiness of the unlimited, the emptiness of that which has neither beginning nor end, the emptiness of nonexclusion, the emptiness of inherent existence, the emptiness of all phenomena, the emptiness of intrinsic defining characteristics, the emptiness of nonapprehensibility, the emptiness of nonentities, the emptiness of essential nature, and the emptiness of the essential nature of nonentities should train in the perfection of wisdom. “
